In [13]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.cluster import KMeans as kms
from sklearn.datasets import make_blobs

In [4]:
final_df = pd.read_csv('data/final_df.csv')
final_df

,Unnamed: 0,name,num_bear,Country,Corporate tax,pagerank_score,CPI score 2015,eigen_score
0,0,DECARIA COMPANY LTD.,2,Samoa,27.0,0.413582,52,4.802
1,1,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,2.063801,52,19.208
2,2,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,2.063801,52,1.200
3,3,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,0.151301,52,19.208
4,4,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,0.151301,52,1.200
...,...,...,...,...,...,...,...,...
36690,36690,SUZANNE CORP.,2,India,22.0,0.575000,38,7.203
36691,36691,HANSAN CORP.,2,India,22.0,0.447500,38,7.203
36692,36692,SAUCHER HOLDING CORPORATION,2,Kenya,30.0,0.787500,25,6.002
36693,36693,Flexi-mobile Limited,2,Kenya,30.0,0.298750,25,3.601
36694,36694,CONSULT INTERNATIONAL LIMITED,5,Finland,20.0,0.596250,90,7.203

In [21]:
# df = final_df(final_df,columns=['num_bear','Corporate tax', 'pagerank_score', 'CPI score 2015'])
  
# kmeans = KMeans(n_clusters=4).fit(df)
# centroids = kmeans.cluster_centers_
# print(centroids)

# plt.scatter(df['x'], df['y'], c= kmeans.labels_.astype(float), s=50, alpha=0.5)
# plt.scatter(centroids[:, 0], centroids[:, 1], c='red', s=50)
# plt.show()

In [15]:
final_df

,Unnamed: 0,name,num_bear,Country,Corporate tax,pagerank_score,CPI score 2015,eigen_score
0,0,DECARIA COMPANY LTD.,2,Samoa,27.0,0.413582,52,4.802
1,1,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,2.063801,52,19.208
2,2,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,2.063801,52,1.200
3,3,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,0.151301,52,19.208
4,4,DRAGONTLY TELECOMMUNICATIONS INC.,15,Samoa,27.0,0.151301,52,1.200
...,...,...,...,...,...,...,...,...
36690,36690,SUZANNE CORP.,2,India,22.0,0.575000,38,7.203
36691,36691,HANSAN CORP.,2,India,22.0,0.447500,38,7.203
36692,36692,SAUCHER HOLDING CORPORATION,2,Kenya,30.0,0.787500,25,6.002
36693,36693,Flexi-mobile Limited,2,Kenya,30.0,0.298750,25,3.601
36694,36694,CONSULT INTERNATIONAL LIMITED,5,Finland,20.0,0.596250,90,7.203

In [18]:
df = final_df.drop(columns=['Unnamed: 0', 'name', 'Country'])
df.head()

   num_bear  Corporate tax  pagerank_score  CPI score 2015  eigen_score
0         2           27.0        0.413582              52        4.802
1        15           27.0        2.063801              52       19.208
2        15           27.0        2.063801              52        1.200
3        15           27.0        0.151301              52       19.208
4        15           27.0        0.151301              52        1.200

In [25]:
# Convert DataFrame to matrix
mat = df.values
# Using sklearn
km = kms(n_clusters=5)
km.fit(mat)
# Get cluster assignment labels
labels = km.labels_
# Format results as a DataFrame
results = pd.DataFrame([df.index,labels]).T
results[1].nunique()

5

In [27]:
results[1].value_counts()

0    24998
2     8487
4     3174
3       35
1        1
Name: 1, dtype: int64

In [29]:
results['name'] = final_df['name']
results

           0  1                               name
0          0  2               DECARIA COMPANY LTD.
1          1  2  DRAGONTLY TELECOMMUNICATIONS INC.
2          2  2  DRAGONTLY TELECOMMUNICATIONS INC.
3          3  2  DRAGONTLY TELECOMMUNICATIONS INC.
4          4  2  DRAGONTLY TELECOMMUNICATIONS INC.
...      ... ..                                ...
36690  36690  2                      SUZANNE CORP.
36691  36691  2                       HANSAN CORP.
36692  36692  2        SAUCHER HOLDING CORPORATION
36693  36693  2               Flexi-mobile Limited
36694  36694  0      CONSULT INTERNATIONAL LIMITED

[36695 rows x 3 columns]

In [30]:
results = results.drop(columns=0)
results #base_clusters

       1                               name
0      2               DECARIA COMPANY LTD.
1      2  DRAGONTLY TELECOMMUNICATIONS INC.
2      2  DRAGONTLY TELECOMMUNICATIONS INC.
3      2  DRAGONTLY TELECOMMUNICATIONS INC.
4      2  DRAGONTLY TELECOMMUNICATIONS INC.
...   ..                                ...
36690  2                      SUZANNE CORP.
36691  2                       HANSAN CORP.
36692  2        SAUCHER HOLDING CORPORATION
36693  2               Flexi-mobile Limited
36694  0      CONSULT INTERNATIONAL LIMITED

[36695 rows x 2 columns]

In [32]:
results = results.rename(columns={1:'cluster'})
results

       cluster                               name
0            2               DECARIA COMPANY LTD.
1            2  DRAGONTLY TELECOMMUNICATIONS INC.
2            2  DRAGONTLY TELECOMMUNICATIONS INC.
3            2  DRAGONTLY TELECOMMUNICATIONS INC.
4            2  DRAGONTLY TELECOMMUNICATIONS INC.
...        ...                                ...
36690        2                      SUZANNE CORP.
36691        2                       HANSAN CORP.
36692        2        SAUCHER HOLDING CORPORATION
36693        2               Flexi-mobile Limited
36694        0      CONSULT INTERNATIONAL LIMITED

[36695 rows x 2 columns]